app/controllers/api/v1/messages_controller.rb

    def show
      message = Message.find(params[:id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
      user = User.find_by_email(message_params[:receiver_email])
      message = Message.new(message_params.merge(from: @current_user.id))
      message.to = user.id if user

      if message.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "master@email.com"], ["LIMIT", 1]]
INSERT INTO "messages" ("title", "content", "from", "to", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "APITEST"], ["content", "CONTEUDO"], ["from", 1], ["to", 1], ["created_at", "2020-08-03 14:36:11.538178"], ["updated_at", "2020-08-03 14:36:11.538178"]]