app/controllers/api/v1/users_controller.rb

    def update
      if user_params[:password].blank? || user_params[:password_confirmation].blank?
        params[:user].delete(:password)
        params[:user].delete(:password_confirmation)
      end

      if @current_user.update(user_params)
---
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Murilo"], ["updated_at", "2020-08-03 17:22:10.352532"], ["id", 1]]