app/controllers/messages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "murilo@gmail.com"], ["LIMIT", 1]]
INSERT INTO "messages" ("title", "content", "from", "to", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Assunto"], ["content", "Conteúdo"], ["from", 1], ["to", 1], ["created_at", "2020-08-02 12:43:22.419351"], ["updated_at", "2020-08-02 12:43:22.419351"]]
---
  def create
    user = User.find_by_email(message_params[:receiver_email]) # find user by email instead of id
    @message = Message.new(message_params.merge(from: current_user.id)) # adds current_user id as sender of the message
    @message.to = user.id if user # if user is not found , message is rejected

    if @message.save

SELECT  "messages".* FROM "messages" WHERE "messages"."title" = $1 LIMIT $2  [["title", "Kléber Arriaga"], ["LIMIT", 1]]
---
  def archive
    @message = Message.find_by_title(params[:title])

SELECT "messages".* FROM "messages" WHERE "messages"."id" IN (122, 123)
---
  def archive_multiple
    messages = Message.find(params[:messages_ids])