app/controllers/users_controller.rb

  def update
    if user_params[:password].blank? || user_params[:password_confirmation].blank?
      params[:user].delete(:password)
      params[:user].delete(:password_confirmation)
    end

    if @user.update(user_params)
---
UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "$2a$04$tUVP9rVAJcjtK5Bz2YpZ1OoRl03Xioh2p2pwHDKuCWtZWecskqQ0i"], ["updated_at", "2020-06-26 12:28:44.380611"], ["id", 93]]

  def messages
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]